---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPowerFactorState
source: html/72ef1294-fa52-f4e0-6309-7cd24fa5de33.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPowerFactorState Property

"Power Factor State"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPowerFactorState { get; }
```